<?php
/**
 * Домашнее задание №2
 *автор Евгений Зайнутдинов
 *страница выводит разное приветствие в зависимости от времени суток,
 *и предложения по меню, в зависимости от кулинарных предпочтений клиента
 */
    $userName = 'Василий'; //имя пользователя
    $time =  (int) date (G); //Запрашиваем время, сразу переводим в целое число


    echo "<h1> Привет,  $userName!</h1>";
    //echo "$time<br>";  Проверка как запросилось время
    //echo gettype($time); проверка, какого типа в итоге время

    swith 

   ?>
