<?php
/**
 * Created by PhpStorm.
 * User: zaynutdinov.er
 * Date: 07.07.2016
 * Time: 16:38
 * Данные, выводимые на экран
 */

$categories = [
    0 => [
        "name" => "home",
        "descript" => "Домашние дела",
    ],
    1 => [
        "name" => "work",
        "descript" => "Работа",
    ],
    2 => [
        "name" => "private",
        "descript" => "Личные дела",
    ],
    3 => [
        "name" => "family",
        "descript" => "Семья",
    ],
    4 => [
        "name" => "education",
        "descript" => "Образование",
    ],
    5 => [
        "name" => "health",
        "descript" => "Здоровье",
    ],
    6 => [
        "name" => "rest",
        "descript" => "отдых",
    ],

];

$tasks = [
    0 => [
        "category" => "work",
        "descript" => 'Нет такой задачи',
    ],
    1 => [
        "name" => "Проверить проекторы",
        "category" => "work",
        "descript" => 'Пройтись по всем аудиторяим, проверить фильтры проекторов и почистить учетки',
        "details" => "блафывало фывадлодофав ячьсмтджцут смячмтдуцтмчса фывалутвыма ыфавфывафыва
         фывфывафыва фывфывафаыв фывафывав фывафывааыв фывфываыф фывафвыафыва фывафыва ",
    ],
    2 => [
        "name" => "Название задачи",
        "category" => "work",
        "descript" => 'Товар 2',
        "details" => "блафывало фывадлодофав ячьсмтджцут смячмтдуцтмчса фывалутвыма ыфавфывафыва
         фывфывафыва фывфывафаыв фывафывав фывафывааыв фывфываыф фывафвыафыва фывафыва ",
    ],
    3 => [
        "name" => "Название задачи",
        "category" => "private",
        "descript" => 'Товар 3',
        "details" => "блафывало фывадлодофав ячьсмтджцут смячмтдуцтмчса фывалутвыма ыфавфывафыва
         фывфывафыва фывфывафаыв фывафывав фывафывааыв фывфываыф фывафвыафыва фывафыва ",
    ],
    4 => [
        "name" => "Название задачи",
        "category" => "private",
        "descript" => 'Товар 4',
        "details" => "блафывало фывадлодофав ячьсмтджцут смячмтдуцтмчса фывалутвыма ыфавфывафыва
         фывфывафыва фывфывафаыв фывафывав фывафывааыв фывфываыф фывафвыафыва фывафыва ",
    ],
    5 => [
        "name" => "Название задачи",
        "category" => "family",
        "descript" => 'Товар 7',
        "details" => "блафывало фывадлодофав ячьсмтджцут смячмтдуцтмчса фывалутвыма ыфавфывафыва
         фывфывафыва фывфывафаыв фывафывав фывафывааыв фывфываыф фывафвыафыва фывафыва ",
    ],
    6 => [
        "name" => "Название задачи",
        "category" => "family",
        "descript" => 'Товар 8',
        "details" => "блафывало фывадлодофав ячьсмтджцут смячмтдуцтмчса фывалутвыма ыфавфывафыва
         фывфывафыва фывфывафаыв фывафывав фывафывааыв фывфываыф фывафвыафыва фывафыва ",
    ],
    7 => [
        "name" => "Название задачи",
        "category" => "family",
        "descript" => 'Товар 9',
        "details" => "блафывало фывадлодофав ячьсмтджцут смячмтдуцтмчса фывалутвыма ыфавфывафыва
         фывфывафыва фывфывафаыв фывафывав фывафывааыв фывфываыф фывафвыафыва фывафыва ",
    ],
    8 => [
        "name" => "Название задачи",
        "category" => "family",
        "descript" => 'Товар 12',
        "details" => "блафывало фывадлодофав ячьсмтджцут смячмтдуцтмчса фывалутвыма ыфавфывафыва
         фывфывафыва фывфывафаыв фывафывав фывафывааыв фывфываыф фывафвыафыва фывафыва ",
    ],
    9 => [
        "name" => "Название задачи",
        "category" => "education",
        "descript" => 'Товар 15',
        "details" => "блафывало фывадлодофав ячьсмтджцут смячмтдуцтмчса фывалутвыма ыфавфывафыва
         фывфывафыва фывфывафаыв фывафывав фывафывааыв фывфываыф фывафвыафыва фывафыва ",
    ],
    10 => [
        "name" => "Название задачи",
        "category" => "education",
        "descript" => 'Товар 16',
        "details" => "блафывало фывадлодофав ячьсмтджцут смячмтдуцтмчса фывалутвыма ыфавфывафыва
         фывфывафыва фывфывафаыв фывафывав фывафывааыв фывфываыф фывафвыафыва фывафыва ",
    ],
    12 => [
        "name" => "Название задачи",
        "category" => "health",
        "descript" => 'Товар 21',
        "details" => "блафывало фывадлодофав ячьсмтджцут смячмтдуцтмчса фывалутвыма ыфавфывафыва
         фывфывафыва фывфывафаыв фывафывав фывафывааыв фывфываыф фывафвыафыва фывафыва ",
    ],
    24 => [
        "name" => "Название задачи",
        "category" => "health",
        "descript" => 'Товар 24',
        "details" => "блафывало фывадлодофав ячьсмтджцут смячмтдуцтмчса фывалутвыма ыфавфывафыва
         фывфывафыва фывфывафаыв фывафывав фывафывааыв фывфываыф фывафвыафыва фывафыва ",
    ],
    37 => [
        "name" => "Название задачи",
        "category" => "health",
        "descript" => 'Товар 37',
        "details" => "блафывало фывадлодофав ячьсмтджцут смячмтдуцтмчса фывалутвыма ыфавфывафыва
         фывфывафыва фывфывафаыв фывафывав фывафывааыв фывфываыф фывафвыафыва фывафыва ",
    ],
    54 => [
        "name" => "Название задачи",
        "category" => "rest",
        "descript" => 'Товар 54',
        "details" => "блафывало фывадлодофав ячьсмтджцут смячмтдуцтмчса фывалутвыма ыфавфывафыва
         фывфывафыва фывфывафаыв фывафывав фывафывааыв фывфываыф фывафвыафыва фывафыва ",
    ],
    59 => [
        "name" => "Название задачи",
        "category" => "rest",
        "descript" => 'Товар 59',
        "details" => "блафывало фывадлодофав ячьсмтджцут смячмтдуцтмчса фывалутвыма ыфавфывафыва
         фывфывафыва фывфывафаыв фывафывав фывафывааыв фывфываыф фывафвыафыва фывафыва ",
    ],
    76 => [
        "name" => "Название задачи",
        "category" => "home",
        "descript" => 'Товар 76',
        "details" => "блафывало фывадлодофав ячьсмтджцут смячмтдуцтмчса фывалутвыма ыфавфывафыва
         фывфывафыва фывфывафаыв фывафывав фывафывааыв фывфываыф фывафвыафыва фывафыва ",
    ],
    123 => [
        "name" => "Название задачи",
        "category" => "home",
        "descript" => 'Товар 123',
        "details" => "блафывало фывадлодофав ячьсмтджцут смячмтдуцтмчса фывалутвыма ыфавфывафыва
         фывфывафыва фывфывафаыв фывафывав фывафывааыв фывфываыф фывафвыафыва фывафыва ",
    ],
    145 => [
        "name" => "Название задачи",
        "category" => "home",
        "descript" => 'Товар 145',
        "details" => "блафывало фывадлодофав ячьсмтджцут смячмтдуцтмчса фывалутвыма ыфавфывафыва
         фывфывафыва фывфывафаыв фывафывав фывафывааыв фывфываыф фывафвыафыва фывафыва ",
    ],
];

/**
 * Тестовые выводы значений:
 *
 * $testarr = [1,2,3];
 * echo $testarr[0];
 * echo $testarr[1];
 * echo $testarr[2];
 * echo $tasks[0][descript];
 */
/**
 * @param $item
 * Функция выводит одну отдельную задачу из массива задач.
 * Принимает в качетве параметра элемент массива задач
 * Выводит сначала заголовок, а потом текст описания задачи.
 *
function writeTask($item)
{
    ?>
    <div class="taskDiv">
        <p><b> <?= $item[name] ?> </b></p>

        <p> <?= $item[descript] ?></p>

    </div>
    <?php
}
 функция перенесена в файл "функции"*/

/**
 * @param $item
 * Функция похожа на предыдущую, то выводит также и категорию, к которой относится задача
 */

/**
function writeTaskCat($item)
{
    ?>
    <div class="taskDiv">
        <p><b> <?= $item[name] ?> </b> Категория: <?= $item[category] ?> </p>

        <p> <?= $item[descript] ?></p>

    </div>
    <?php
}*/

//writeTask($tasks[1]); пробный вызов функции

/**
 * @param $arr
 * Функция выводит список всех задач подряд в том порядке, в каком они стоят в массиве в данный момент
 *
function allTasks($arr)
{
    foreach ($arr as $value) {
        writeTaskCat($value); //эта функция выводит одну задачу вместе с категорией
    }
}
*/
//allTasks($tasks); тестовый вызов функции

/**
function tasksByCat($arr, $category)
{
    echo "<p>Все дела категории $category:</p>";
    foreach ($arr as $value) {
        if ($value[category] == "$category") {
            writeTask($value);
        }
    }
}*/

//tasksByCat($tasks, "rest"); пробный вывоз функции
/**
function taskDetalaized($item)
{
    writeTaskCat($item);
    echo "<p><b>Детальное описание задачи:</b></p>" . $item[details];
    echo "<br>";
} */

//taskDetalaized ($tasks[1]);






